app/controllers/hero_powers_controller.rb

INSERT INTO "hero_powers" ("strength", "power_id", "hero_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["strength", "strong"], ["power_id", 1], ["hero_id", 1], ["created_at", "2023-03-27 09:28:28.546149"], ["updated_at", "2023-03-27 09:28:28.546149"]]
---
    def create
        hero_power = HeroPower.create!(hero_powers_params)