app/controllers/heros_controller.rb

    def index
        render json: Hero.all
---
SELECT "heros".* FROM "heros"

    def find_hero
        Hero.find(params[:id])
---
SELECT "heros".* FROM "heros" WHERE "heros"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]