app/controllers/powers_controller.rb

SELECT "powers".* FROM "powers"
---
    def index
        render json: Power.all

INSERT INTO "powers" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "hgssh"], ["description", "hdehygfexnaxjxsnxjsauyddh"], ["created_at", "2023-03-27 09:23:38.937347"], ["updated_at", "2023-03-27 09:23:38.937347"]]
---
    def create
        power = Power.create(power_params)

UPDATE "powers" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "powers"."id" = ?  [["name", "gxggdg"], ["description", "xgvxvgygadyugwhgcgvwgdyuwy"], ["updated_at", "2023-03-27 09:24:48.743108"], ["id", 1]]
---
    def update
        power = find_power
        power.update!(power_description_params)

SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_power
        Power.find(params[:id])